{
    "400": "The server cannot complete the request due to malformed syntax.",
    "401": "You are not authorized to access the requested URI at this time.",
    "402": "You cannot access the requested URI because you have not sent the appropriate funds to the administrator.",
    "403": "You are not allowed to access the requested URI on this server.",
    "404": "The requested URI was not found on this server.",
    "405": "The request method you provided is not allowed for this URI.",
    "406": "The server is only capable of generating content defined as unacceptable by the request’s Accept headers.",
    "407": "You must authenticate with the Proxy to gain access to this URI.",
    "408": "The server timed out while awaiting a response from the client.",
    "409": "The request could not be processed due to a conflict of resources located on the server.",
    "410": "The requested URI has been permanently removed from this server.",
    "411": "The request did not specify the length of its content, which is required by the requested resource.",
    "412": "The server does not meet one or more of the preconditions that were provided in the request header.",
    "413": "The request is larger than the server is willing or able to process.",
    "414": "The URI provided was too long for the server to process.",
    "415": "The request entity has a media type which the server or resource does not support.",
    "416": "The client has asked for a portion of the resource, but the server cannot supply that portion.",
    "417": "The server cannot meet the requirements of the Expect request-header field.",
    "418": "I’m a teapot, not a coffee pot! I can only make tea!",
    "421": "The request was directed at a server that is not able to produce a response.",
    "422": "The request was well-formed but was unable to be followed due to semantic errors.",
    "423": "The resource that is being accessed is locked.",
    "424": "The request failed due to failure of a previous request.",
    "426": "The client needs to switch to a different protocol in order to access the requested resource.",
    "428": "The origin server requires the request to be conditional.",
    "429": "The client has sent too many requests in too short a span of time.",
    "431": "The server is unwilling to process the request because either an individual header field, or all the header fields collectively, are too large.",
    "451": "A server operator has received a legal demand to deny access to a resource or to a set of resources that includes the requested resource.",
    "500": "The server encountered an unknown error and was unable to process the request.",
    "501": "The server either does not recognize the request method, or it lacks the ability to fulfill the request.",
    "502": "The server was acting as a gateway or proxy and received an invalid response from the upstream server.",
    "503": "The server is currently unavailable or down for maintenance. We don’t know when or if the server will be back online.",
    "504": "The server was acting as a gateway or proxy and did not receive a timely response from the upstream server.",
    "505": "The server does not support the HTTP protocol version used in the request.",
    "506": "Transparent content negotiation for the request results in a circular reference.",
    "507": "The server is unable to store the representation needed to complete the request.",
    "508": "The server detected an infinite loop while processing the request.",
    "509": "The server has exceeded the bandwidth limits specified by the network administrator.",
    "510": "Further extensions to the request are required for the server to be able to fulfill it.",
    "511": "The client needs to authenticate to gain network access."
}
